# # Введення (отримання даних)
# ім_я = input("Введіть ваше ім'я: ")

# # Перетворення (обробка даних)
# вітання = f"Привіт, {ім_я}!"

# # Виведення (виведення даних)
# print(вітання)

# s1 = "Василь"
# s2 = "Васильович!"
# joined_string = f"Здарова! {s1} {s2}"
# print (joined_string)

# s1 = 'Hello'
# s2 = 'world!'
# joined_string = f"{s1} {s2}"  # Hello world!

# x1 = 10
# y1 = 10
# x2 = 25
# y2 = 25
# d = ((x1-x2)**2 + (y1-y2)**2)**0.5
# print (d)

a = float(input("Введіть сторону квадрата:"))
P = 4*a
print(f"Периметр квадрата дорівнює {P}")